{
  "</s>": 6692,
  "<mask>": 6694,
  "<pad>": 6693,
  "<s>": 6691,
  "<sep/>": 6695,
  "〱": 6576,
  "〲": 6481,
  "〻": 6542,
  "〽": 6205,
  "ゟ": 6440,
  "ヽ": 6191,
  "ヾ": 6570,
  "㊀": 6159,
  "㊁": 6607,
  "㊂": 6320,
  "㊃": 6154,
  "㊄": 6548,
  "㐂": 6184,
  "㑹": 6318,
  "㒵": 6633,
  "㓛": 6386,
  "㔟": 6676,
  "㔫": 6337,
  "㕝": 6354,
  "㘴": 6326,
  "㚑": 6278,
  "㝡": 6463,
  "㠶": 6533,
  "㡌": 6575,
  "㣲": 6285,
  "㫖": 6640,
  "䂓": 6619,
  "䏣": 6210,
  "䐈": 6172,
  "䑓": 6501,
  "䕃": 6475,
  "两": 6507,
  "丱": 6192,
  "亍": 6581,
  "仆": 6240,
  "仭": 6430,
  "伉": 6315,
  "伱": 6182,
  "佶": 6332,
  "侲": 6579,
  "俤": 6412,
  "倏": 6371,
  "倰": 6187,
  "偖": 6679,
  "偸": 6601,
  "傚": 6447,
  "僂": 6394,
  "僜": 6532,
  "僮": 6417,
  "僵": 6477,
  "價": 6217,
  "儉": 6416,
  "凩": 6390,
  "刅": 6595,
  "刕": 6586,
  "劄": 6372,
  "勦": 6662,
  "匆": 6467,
  "卅": 6297,
  "卥": 6422,
  "卩": 6424,
  "厂": 6211,
  "叮": 6469,
  "吁": 6433,
  "吭": 6626,
  "吮": 6512,
  "哢": 6382,
  "哽": 6589,
  "啁": 6587,
  "啗": 6675,
  "啻": 6414,
  "喃": 6166,
  "喟": 6544,
  "喻": 6580,
  "嗔": 6599,
  "嘈": 6188,
  "嘸": 6470,
  "嘻": 6268,
  "噎": 6644,
  "噪": 6608,
  "噫": 6375,
  "噬": 6456,
  "嚀": 6547,
  "囀": 6672,
  "囓": 6436,
  "圑": 6266,
  "塒": 6167,
  "壑": 6294,
  "壟": 6373,
  "壼": 6342,
  "夥": 6448,
  "夯": 6478,
  "姒": 6305,
  "娌": 6583,
  "娵": 6257,
  "婪": 6634,
  "媵": 6418,
  "嫗": 6594,
  "嫵": 6427,
  "嬋": 6680,
  "嬖": 6664,
  "孑": 6358,
  "孰": 6296,
  "寐": 6250,
  "寞": 6379,
  "寤": 6454,
  "尠": 6225,
  "尢": 6480,
  "屡": 6356,
  "岨": 6506,
  "峽": 6407,
  "嶮": 6631,
  "庖": 6153,
  "庻": 6528,
  "廪": 6288,
  "廰": 6428,
  "廾": 6393,
  "彂": 6590,
  "彳": 6445,
  "徉": 6661,
  "徜": 6236,
  "徤": 6515,
  "忝": 6522,
  "忰": 6421,
  "忿": 6197,
  "怕": 6649,
  "怙": 6635,
  "恃": 6496,
  "恖": 6279,
  "恙": 6223,
  "恚": 6177,
  "悋": 6663,
  "悒": 6636,
  "悖": 6392,
  "悵": 6474,
  "惆": 6303,
  "惻": 6408,
  "愀": 6600,
  "愧": 6201,
  "愽": 6218,
  "慂": 6444,
  "慙": 6239,
  "慥": 6170,
  "慫": 6163,
  "慳": 6293,
  "憖": 6658,
  "懈": 6178,
  "懶": 6476,
  "扑": 6647,
  "扛": 6555,
  "扣": 6399,
  "扨": 6677,
  "找": 6214,
  "抓": 6224,
  "抔": 6666,
  "抛": 6243,
  "抦": 6657,
  "拄": 6349,
  "拇": 6591,
  "拊": 6614,
  "挊": 6378,
  "挌": 6498,
  "捫": 6660,
  "捶": 6374,
  "掉": 6147,
  "掫": 6432,
  "揩": 6435,
  "搏": 6632,
  "摚": 6497,
  "摧": 6241,
  "擒": 6277,
  "擡": 6331,
  "擴": 6206,
  "敝": 6652,
  "旃": 6385,
  "晞": 6602,
  "曚": 6603,
  "杠": 6324,
  "枴": 6551,
  "枸": 6209,
  "柤": 6552,
  "柬": 6683,
  "栲": 6304,
  "桾": 6452,
  "梺": 6550,
  "梼": 6391,
  "棉": 6569,
  "棊": 6362,
  "棐": 6404,
  "椹": 6274,
  "椽": 6281,
  "楂": 6518,
  "楙": 6405,
  "楜": 6221,
  "楝": 6321,
  "楪": 6355,
  "榾": 6588,
  "槁": 6513,
  "槛": 6301,
  "槫": 6439,
  "槹": 6367,
  "樔": 6260,
  "檍": 6248,
  "櫺": 6598,
  "欝": 6350,
  "歇": 6252,
  "歛": 6341,
  "歟": 6465,
  "歹": 6340,
  "殞": 6364,
  "殯": 6558,
  "毆": 6207,
  "毟": 6489,
  "泅": 6609,
  "泔": 6180,
  "泻": 6360,
  "浥": 6179,
  "涕": 6146,
  "淚": 6262,
  "溏": 6627,
  "溙": 6289,
  "潑": 6325,
  "潦": 6494,
  "潯": 6162,
  "潸": 6160,
  "澡": 6165,
  "炷": 6302,
  "烮": 6686,
  "煆": 6682,
  "熬": 6251,
  "燠": 6388,
  "爰": 6310,
  "牀": 6459,
  "犇": 6190,
  "狎": 6566,
  "狰": 6559,
  "狷": 6457,
  "狻": 6684,
  "獬": 6242,
  "琫": 6150,
  "甍": 6685,
  "畋": 6535,
  "畾": 6491,
  "疳": 6612,
  "痤": 6200,
  "瘖": 6656,
  "瘞": 6249,
  "瘟": 6292,
  "瘰": 6156,
  "癈": 6499,
  "眇": 6530,
  "眛": 6572,
  "眤": 6308,
  "眦": 6333,
  "睪": 6267,
  "瞋": 6338,
  "瞪": 6545,
  "砍": 6521,
  "磤": 6231,
  "磽": 6402,
  "禀": 6183,
  "离": 6578,
  "秡": 6564,
  "秬": 6282,
  "窶": 6254,
  "窹": 6396,
  "竅": 6193,
  "竊": 6406,
  "竭": 6531,
  "笆": 6464,
  "笧": 6370,
  "筎": 6271,
  "篗": 6208,
  "篷": 6330,
  "簍": 6275,
  "簓": 6204,
  "簔": 6198,
  "籆": 6482,
  "粔": 6348,
  "粳": 6624,
  "糒": 6411,
  "糕": 6538,
  "糝": 6380,
  "糫": 6309,
  "糯": 6345,
  "紵": 6539,
  "絮": 6383,
  "緇": 6524,
  "縑": 6256,
  "縡": 6280,
  "縧": 6639,
  "繅": 6519,
  "繻": 6670,
  "纔": 6529,
  "纜": 6665,
  "罌": 6347,
  "羈": 6313,
  "羔": 6189,
  "羙": 6637,
  "翺": 6229,
  "耄": 6605,
  "耒": 6368,
  "耦": 6148,
  "肚": 6323,
  "胯": 6567,
  "胼": 6161,
  "脔": 6259,
  "腥": 6357,
  "腮": 6145,
  "膈": 6687,
  "臉": 6265,
  "艚": 6151,
  "艡": 6458,
  "艫": 6669,
  "芟": 6571,
  "芡": 6473,
  "苡": 6316,
  "苣": 6554,
  "苵": 6650,
  "茴": 6353,
  "荅": 6317,
  "莅": 6573,
  "莧": 6628,
  "莨": 6311,
  "菪": 6346,
  "菽": 6270,
  "萆": 6339,
  "萓": 6272,
  "葍": 6195,
  "葎": 6363,
  "葩": 6485,
  "蒡": 6651,
  "蓙": 6516,
  "蔔": 6226,
  "蔘": 6425,
  "蕀": 6689,
  "蕢": 6630,
  "蕣": 6155,
  "薏": 6625,
  "薑": 6582,
  "薜": 6264,
  "薹": 6352,
  "薺": 6215,
  "藐": 6466,
  "藜": 6468,
  "蘘": 6511,
  "蘰": 6213,
  "虧": 6169,
  "虬": 6553,
  "虯": 6261,
  "虱": 6648,
  "蚓": 6688,
  "蚢": 6334,
  "蚫": 6232,
  "蚯": 6171,
  "蚰": 6642,
  "蚶": 6525,
  "蛥": 6442,
  "蜋": 6344,
  "蜑": 6681,
  "蜒": 6173,
  "蜿": 6471,
  "蝤": 6328,
  "蝴": 6540,
  "蟋": 6233,
  "蟶": 6492,
  "蠎": 6157,
  "衲": 6462,
  "衽": 6560,
  "袒": 6245,
  "裘": 6622,
  "裙": 6185,
  "裹": 6343,
  "褁": 6237,
  "褊": 6500,
  "褓": 6638,
  "襁": 6453,
  "襠": 6520,
  "覿": 6222,
  "觴": 6329,
  "誂": 6283,
  "諚": 6690,
  "諛": 6659,
  "諢": 6290,
  "謫": 6629,
  "豈": 6322,
  "豌": 6546,
  "豕": 6319,
  "豢": 6431,
  "貟": 6584,
  "贏": 6563,
  "趁": 6668,
  "跌": 6504,
  "跟": 6273,
  "跼": 6255,
  "蹇": 6247,
  "蹤": 6429,
  "軈": 6606,
  "輙": 6287,
  "輾": 6403,
  "轎": 6534,
  "轤": 6610,
  "辤": 6246,
  "迚": 6455,
  "逈": 6616,
  "逰": 6409,
  "遑": 6449,
  "遖": 6149,
  "遶": 6556,
  "酖": 6472,
  "醢": 6387,
  "醭": 6654,
  "醯": 6617,
  "醴": 6653,
  "醼": 6510,
  "鈬": 6674,
  "鏐": 6450,
  "鏤": 6381,
  "鏥": 6645,
  "鐃": 6291,
  "鐫": 6234,
  "鑛": 6568,
  "鑵": 6517,
  "閙": 6398,
  "閧": 6574,
  "闌": 6443,
  "隺": 6655,
  "雋": 6299,
  "霎": 6286,
  "霏": 6508,
  "靨": 6158,
  "鞁": 6460,
  "頥": 6593,
  "顋": 6384,
  "顱": 6505,
  "飩": 6152,
  "餬": 6420,
  "餮": 6312,
  "餹": 6451,
  "餻": 6397,
  "饀": 6144,
  "饂": 6176,
  "饑": 6238,
  "饕": 6415,
  "饘": 6565,
  "馭": 6164,
  "駑": 6461,
  "駟": 6526,
  "駭": 6276,
  "驫": 6194,
  "髫": 6361,
  "髱": 6621,
  "鬟": 6377,
  "鬩": 6623,
  "鬪": 6597,
  "鬮": 6426,
  "魘": 6646,
  "魦": 6678,
  "魼": 6437,
  "鮗": 6300,
  "鮟": 6227,
  "鮠": 6479,
  "鮦": 6212,
  "鮧": 6235,
  "鮲": 6196,
  "鮹": 6493,
  "鯊": 6423,
  "鯑": 6543,
  "鯒": 6434,
  "鯔": 6410,
  "鯲": 6219,
  "鯷": 6483,
  "鰆": 6441,
  "鰈": 6549,
  "鰌": 6199,
  "鰔": 6503,
  "鰛": 6284,
  "鰣": 6523,
  "鰤": 6620,
  "鰥": 6419,
  "鰩": 6495,
  "鰲": 6577,
  "鰶": 6307,
  "鱆": 6258,
  "鱇": 6604,
  "鱏": 6181,
  "鱚": 6389,
  "鱝": 6298,
  "鱠": 6351,
  "鱣": 6314,
  "鱧": 6671,
  "鱲": 6673,
  "鱶": 6486,
  "鱸": 6611,
  "鳽": 6541,
  "鴃": 6527,
  "鴆": 6359,
  "鴞": 6174,
  "鴿": 6175,
  "鵆": 6395,
  "鵉": 6557,
  "鵙": 6186,
  "鶍": 6643,
  "鸛": 6502,
  "麈": 6306,
  "麋": 6366,
  "麌": 6327,
  "麕": 6596,
  "黏": 6295,
  "黠": 6509,
  "黨": 6514,
  "黯": 6536,
  "黿": 6641,
  "鼇": 6618,
  "練": 6667,
  "蓮": 6446,
  "隆": 6585,
  "精": 6484,
  "僧": 6168,
  "器": 6376,
  "層": 6203,
  "憎": 6413,
  "海": 6438,
  "琢": 6615,
  "突": 6220,
  "臭": 6336,
  "贈": 6562,
  "難": 6401,
  "－": 6400,
  "Ｏ": 6228,
  "𠀋": 6335,
  "𠵅": 6487,
  "𢦙": 6269,
  "𢳣": 6537,
  "𣇃": 6488,
  "𣏐": 6230,
  "𣴎": 6263,
  "𤋎": 6244,
  "𤍽": 6202,
  "𤸰": 6490,
  "𤹠": 6365,
  "𥙊": 6613,
  "𥝐": 6369,
  "𥸮": 6216,
  "𥿻": 6592,
  "𦚰": 6253,
  "𨉣": 6561
}
